import React from 'react';
// Images
import motoFirst from '../../assets/bmw-r32-201507-web-0610.jpg';
import motoSecond from '../../assets/BMW-R-24-2105_3.jpg';
import motoThird from '../../assets/small_BMW_S_1000_RR_carbike360_bbb4ca21ff.webp';
// Styles
import s from '../Cars/index.module.scss';

export const Motorcycle: React.FC = () => {
    return (
        <div className={s.cars__container}>
            <article className={s.cars__article}>
                <h1 className={s.cars__article__title}>
                    Історія мотоциклів BMW
                </h1>
                <p className={s.cars__history__title}>
                    1921–1938 роки
                </p>
                <p className={s.cars__article__text}>
                    Наприкінці Першої світової війни Версальський договір вимагав від BMW припинити виробництво авіаційних двигунів. Щоб залишитися в бізнесі, компанія почала виробляти невеликі промислові двигуни (разом із сільськогосподарським обладнанням, предметами побуту та залізничними гальмами). У 1920 році був випущений двоциліндровий бензиновий двигун BMW M2B15 . Незважаючи на те, що він був розроблений як портативний промисловий двигун, M2B15 також використовувався декількома виробниками мотоциклів, у тому числі для мотоциклів Victoria KR1 1920–1923 років і мотоциклів Helios Bayerische Flugzeugwerke (BFw) 1920–1922 років.
                </p>
                <div className={s.cars__article__image}>
                    <img 
                        src={motoFirst}
                        alt='motoFirst'
                    />
                </div>
                <p className={s.cars__article__text}>
                    У 1922 році BMW об’єдналася з Bayerische Flugzeugwerke, і BFw Helios став відправною точкою для першого мотоцикла BMW. Випущений у 1923 році BMW R 32 використовував 486 куб . . Цей двигун потужністю 6,3 кВт (8,5 к.с.) забезпечує максимальну швидкість від 95 до 100 км/год (від 59 до 62 миль/год). У той час, коли багато виробників мотоциклів використовували системи мастила з повною втратою, новий двигун BMW мав рециркуляційну систему мастила з мокрим картером із краплинною подачею до роликових підшипників; дизайн, який BMW використовував до 1969 року. R 32 також започаткував традицію валового приводу , який використовувався на всіх мотоциклах BMW до 1994 року.
                </p>
            </article>
            <div className={s.cars__article}>
                <h2 className={s.cars__history__title}>1939–1945 роки</h2>
                <p className={s.cars__history__text}>
                    Під час Другої світової війни німецьким військовим було потрібно якомога більше транспортних засобів усіх типів, і багатьом іншим німецьким компаніям було запропоновано будувати мотоцикли. BMW R 75 показав себе особливо добре в суворих умовах експлуатації в Північній Африці, частково завдяки виступаючим циліндрам плоского здвоєного двигуна, що забезпечує більш ефективне охолодження, ніж інші конфігурації, які перегрівалися на сонці. Вальні приводи також працювали краще, ніж ланцюгові, які були пошкоджені піском у пустелі. R 75 надихнув подібні моделі американських виробників, наприклад Indian 841 і Harley-Davidson XA .
                </p>
                <p className={s.cars__history__text}>
                    Постійне виробництво побутової техніки тривало в Мюнхені, але лише в 1948 році BMW вдалося відновити виробництво автомобілів, випустивши мотоцикл R24. Незважаючи на те, що він базувався на довоєнному дизайні, він був дуже популярним, продавши понад 9000 екземплярів протягом 1949 року, і це допомогло компанії утриматися на плаву до 1950-х років, коли виробництво автомобілів було відновлено.
                </p>
                <p className={s.cars__history__text}>
                    У контрольованій Радянським Союзом Східній Німеччині єдиний мотоциклетний завод BMW в Айзенаху відновив виробництво мотоциклів R35 і R75 невдовзі після війни за репарації . Фабрика продовжувала використовувати назву BMW, через що дві окремі компанії (одна в Айзенаху, а інша в Мюнхені, Західна Німеччина) використовували назву BMW між 1948 і 1952 роками. Головний офіс BMW, розташований у Мюнхені, не мав контролю. щодо операцій у Східній Німеччині. Врешті-решт у 1952 році, після того, як радянська влада передала контроль над заводом уряду Східної Німеччини, і після позову щодо торгової марки східнонімецька компанія була перейменована на Eisenacher Motorenwerk (EMW). Замість синьо-білого круглого знака BMW, EMW використовував дуже схожий червоно-білий круглий знак як свій логотип. 
                </p>
                <p className={s.cars__history__text}>
                    У Західній Німеччині багато заводів BMW були сильно пошкоджені під час війни, включаючи Мюнхенський завод, який був у руїнах. Спочатку умови капітуляції Німеччини забороняли BMW виробляти мотоцикли. У 1947 році, коли BMW отримала дозвіл на відновлення виробництва мотоциклів від влади США в Баварії, BMW довелося починати з нуля. Не було жодних планів, креслень чи схематичних креслень, тому що всі вони були в Айзенахі. Першим післявоєнним мотоциклом BMW у Західній Німеччині став BMW R 24 1948 року . R 24 був перероблений на основі довоєнного мотоцикла BMW R 23 з кількома вдосконаленнями і оснащений одноциліндровим двигуном об’ємом 247 куб.см (15 куб. дюймів). Це була єдина післявоєнна західнонімецька модель без задньої підвіски. У 1949 році BMW випустила 9200 одиниць, а до 1950 року виробництво перевищило 17 000 одиниць.
                </p>
                <div className={s.cars__article__image}>
                    <img 
                        src={motoSecond}
                        alt='motoSecond'
                    />
                </div>
            </div>
            <div className={s.cars__article}>
                <h2 className={s.cars__history__title}>1955–1969 роки</h2>
                <p className={s.cars__history__text}>
                    У 1950-х роках продажі мотоциклів у Європі різко впали, а три головні німецькі конкуренти BMW припинили діяльність у 1967 році. У 1954 році BMW випустила 30 000 мотоциклів. До 1957 року це число було менше 5500.
                </p>
                <p className={s.cars__history__text}>
                    У 1955 році BMW почала випускати нову лінійку мотоциклів з вилками Earles і закритими карданними валами. Це були BMW R 50 потужністю 19 кВт (26 к.с.) , BMW R 60 потужністю 22 кВт (30 к.с.) і спортивна модель BMW R 69 потужністю 35 к.с. (26 кВт). 8 червня 1959 року Джон Пентон проїхав на BMW R 69 з Нью-Йорка до Лос-Анджелеса за 53 години 11 хвилин, перевищивши попередній рекорд на 24 години.
                </p>
                <p className={s.cars__history__text}>
                    До кінця 1950-х років уся компанія BMW зазнала фінансових проблем. Компанія ледве уникла злиття з Daimler-Benz завдяки поєднанню фінансування від братів Герберта Квандта та Харальда Квандта , збільшення успіху автомобільного підрозділу та продажу підрозділу авіаційних двигунів. Зміни на ринку мотоциклів призвели до того, що остання одноциліндрова модель BMW з приводом від валу, BMW R 27 , припинила виробництво в 1967 році. Крім того, більшість пропозицій BMW все ще були розроблені для використання з колясками. Однак наприкінці 1960-х коляски більше не були предметом розгляду для більшості водіїв; натомість людей цікавили більш спортивні мотоцикли. BMW R 50/2 , R 60/2 і R 69 S були останніми автомобілями BMW з колясками, причому останній був найпотужнішою і бажаною моделлю.
                </p>
            </div>
            <div className={s.cars__article}>
                <h2 className={s.cars__history__title}>1969–1982 роки</h2>
                <p className={s.cars__history__text}>
                    Модельний ряд був повністю оновлений у 1969 році з представленням діапазону BMW /5 , що складається з моделей BMW R 50/5 500 cc , BMW R 60/5 600 cc та BMW R 75/5 750 cc .  Двигуни були повністю модернізовані, з підшипниками колінчастого вала оновленими з роликових підшипників на підшипники ковзання корпусу (тип, який використовується в двигунах сучасних автомобілів).  Розподільний вал тепер мав ланцюговий привід і був розташований під колінчастим валом, а не у верхній частині двигуна, щоб знизити центр ваги.  Електричний стартер був доступний вперше, хоча традиційний кікстартер , встановлений на коробці передач, також був збережений.  Стиль перших моделей включав хромовані бічні панелі та оновлений бак. У 1973 році задній маятник був подовжений, що покращило керованість і дозволило встановити більший акумулятор.
                </p>
                <p className={s.cars__history__title}>1993–2003 роки</p>
                <p className={s.cars__history__text}>
                    Починаючи з BMW R 1100 RS sport tourer у 1993 році, BMW почав перехід від двигунів з повітряним охолодженням головок циліндрів («повітряні» двигуни) до масляного охолодження головок циліндрів («масляні» двигуни). BMW R 100 RS також використовував передню підвіску «Telelever» (де гальмівні сили передаються горизонтально, щоб мінімізувати «пірнання вилки») і напружений двигун .
                </p>
                <p className={s.cars__history__title}>
                    2004–2014 роки
                </p>
                <p className={s.cars__history__text}>
                    Переглянута серія серії K рядних чотирициліндрових моделей з водяним охолодженням почалася в 2004 році з BMW K 1200 S, спортивний турер.  K1200S спочатку був розроблений як мотоцикл Super Sport, хоча і більший і важчий, ніж найближчі японські конкуренти. Іншими доповненнями до серії K були 2005 BMW K 1200 R naked bike і споріднений 2007 BMW K 1200 R Sport напівобтічник sport-tourer,  і 2006 BMW K 1200 GT sport-tourer. Об’єм двигуна серії K було збільшено до 1300 куб . 
                </p>
                <p className={s.cars__history__text}>
                    У 2011 році до серії K було додано дві шестициліндрові моделі - BMW K 1600 GT і BMW K 1600 GTL , перша призначена як спорт-турер, а друга — як люкс-турер.
                </p>
                <div className={s.cars__article__image}>
                    <img 
                        src={motoThird}
                        alt='motoThird'
                    />
                </div>
            </div>
        </div>
    );
};
