import React from 'react';
import s from './index.module.scss';
import { Link } from 'react-router-dom';
// Images
import bmwX7 from '../../assets/bmw-x7-front.jpg';
import mcLaren from '../../assets/McLaren-F1-30.jpg';
import bmw750 from '../../assets/test-2019-bmw-750i-xdrive-1992-bmw-735iA-E32-11-1200x800.jpg';

export const Cars: React.FC = () => {
    return (
        <div className={s.cars__container}>
            <article className={s.cars__article}>
                <h1 className={s.cars__article__title}>
                    BMW – Bayerische Motoren Werke (Баварський моторний завод) – бачив багато вершин і спадів на своєму шляху до того, щоб стати дуже успішним виробником
                </h1>
                <p className={s.cars__article__text}>
                    BMW може простежити своє походження до Rapp-Motorenwerke, виробника авіаційних двигунів під час Першої світової війни...
                </p>
                <p className={s.cars__article__text}>
                    На початку BMW була далека від виробництва автомобілів...
                </p>
                <p className={s.cars__article__text}>
                    BMW був дуже успішним у цих підприємствах; у 1920 році він переніс свою головну штаб-квартиру до Мюнхена...
                    <Link to='/motorcycle'>
                        <span className={s.cars__article__link}>мотоцикл</span>
                    </Link>
                    R32...
                </p>
                <p className={s.cars__article__text}>
                    Підбадьорений своїм першим успіхом, BMW придбав компанію Fahrzeugfabrik Eisenach у 1928 році...
                </p>
                <p className={s.cars__article__text}>
                    Щоб довести, що його новий автомобіль справляється зі своїм завданням, BMW негайно вивела 3/15 PS на конкурентну арену міжнародного автоспорту...
                </p>
            </article>
            <div className={s.cars__article}>
                <h2 className={s.cars__history__title}>1940-ті роки</h2>
                <p className={s.cars__history__text}>
                    Коли війна закінчилася, доля BMW серйозно впала, оскільки союзні солдати реквізували та зайняли заводи. BMW була класифікована як збройна компанія, тому її машини та інструменти були демонтовані; тим часом її заводи в Айзенаху та Берліні опинились у Східній Німеччині та перестали бути під її контролем.
                </p>
                <p className={s.cars__history__text}>
                    Постійне виробництво побутової техніки тривало в Мюнхені, але лише в 1948 році BMW вдалося відновити виробництво автомобілів, випустивши мотоцикл R24. Незважаючи на те, що він базувався на довоєнному дизайні, він був дуже популярним, продавши понад 9000 екземплярів протягом 1949 року, і це допомогло компанії утриматися на плаву до 1950-х років, коли виробництво автомобілів було відновлено.
                </p>
                <p className={s.cars__history__title}>1950-ті роки</p>
                <p className={s.cars__history__text}>
                    Першим автомобілем BMW 1950-х років був 501, великий розкішний седан, який також пропонувався як купе та кабріолет з плином десятиліття. Спочатку він використовував оновлену версію довоєнного шестициліндрового двигуна BMW разом із конструкцією підвіски 1930-х років, але продуктивність була дещо пішохідною; оскільки 501 був орієнтований на вищий кінець ринку, йому було важко продати німцям, які все ще були бідними.
                </p>
                <p className={s.cars__history__text}>
                    Питання продуктивності було вирішено завдяки впровадженню двигуна V8, першого в світі двигуна з легкосплавним блоком і головками циліндрів у візуально подібному 502, але, незважаючи на цю передову техніку, це не зробило автомобіль великим продажем. Замість того, щоб представити дешевшу модель, яка мала б більшу привабливість для масового ринку, BMW пішов далі в елітний ринок із елегантним купе та кабріолетом, розробленими Альбректом Графом Гьорцем – 503. Цей автомобіль було важко продати навіть в Америці, де BMW намагався встановити присутність.
                </p>
            </div>
            <div className={s.cars__article}>
                <h2 className={s.cars__history__title}>1960-ті роки</h2>
                <p className={s.cars__history__text}>
                    Забезпечивши фінансову підтримку, BMW міг би розширити свої горизонти далі; під наглядом Квандта було поспішно сконструйовано нову машину разом із новою фабрикою, Мюнхенським заводом у Мільбертсгофені, який працює й сьогодні. 1500, або Neue Klasse (Новий клас), як його стали називати, був розроблений Вільгельмом Хофмейстером і був першим BMW, який мав тепер відомий «злом Гофмайстера» на C-стійці. Це був чистий трикоробний дизайн і чотирициліндровий двигун, розроблений гуру двигунів компанії Олександром фон Фалькенхаузеном. Відомий як M10, він продовжував працювати на поколіннях BMW аж до кінця 1980-х років.
                </p>
                <p className={s.cars__history__text}>
                    Його підвіска також була новою, включала передню вісь McPherson із задньою напівпровісною важеллю, яка використовувалася протягом 60-х, 70-х і 80-х років, поки E36 3 Series нарешті не перейшов на багатоважільну установку. в задній частині. Новий клас став миттєвим хітом, коли він був представлений на Франкфуртському автосалоні 1961 року, і BMW отримала понад 25 000 замовлень на автомобіль до початку виробництва. Він продовжувався у виробництві до 1972 року, до якого було виготовлено понад 350 000 екземплярів. Довгострокове майбутнє BMW тепер було забезпечено.
                </p>
                <p className={s.cars__history__title}>1970-ті роки</p>
                <p className={s.cars__history__text}>
                    Заміна седана New Class була найактуальнішим завданням BMW; У 1972 році відбувся дебют перших автомобілів серії BMW, з якими ми всі так знайомі сьогодні. Перша серія 5 була представлена ​​на Олімпійських іграх у Мюнхені в 1972 році, але цей рік, мабуть, ще більше відомий у колах BMW як дата, коли BMW Motorsport було засновано, щоб піклуватися про свої подвиги в автоперегонах.
                </p>
                <p className={s.cars__history__text}>
                    Завдання BMW M полягало в тому, щоб перемогти Ford Capri на трасі в Європейському чемпіонаті з туристичних автомобілів (ETCC). Для цього він випустив версію 3.0 CSL купе E9, автомобіль настільки хороший, що він виграв ETCC у 1973 році, а потім знову протягом п’яти років поспіль з 1975 по 1979 рік. Гоночний автомобіль породив остаточну версію моделі, яка була відомий як Бетмобіль за його великий аеродинамічний комплект крил, який забезпечував високу швидкість керування.
                </p>
                <p className={s.cars__history__text}>
                    Розвиток серійних автомобілів тривав швидкими темпами, і BMW Motorsport доклав руку до того, щоб вдихнути нове життя в стару модель 2002 року, випустивши 2002 Turbo, перший в Європі серійний автомобіль з турбонаддувом. На жаль, його випуск збігся з паливною кризою середини 70-х, тому автомобіль не мав комерційного успіху.
                </p>
            </div>
            <div className={s.cars__article}>
                <h2 className={s.cars__history__title}>1980-ті роки</h2>
                <p className={s.cars__history__text}>
                    Нова впевненість та інженерне ноу-хау BMW були вміло продемонстровані в його першій кампанії у Формулі-1, кульмінацією якої стала перемога Brabham BT52 з двигуном BMW з Нельсоном Піке за кермом. Двигун BMW з турбонаддувом мав репутацію найпотужнішого на сітці та розвивав понад 1000 к.с. у кваліфікаційній комплектації.
                </p>
                <p className={s.cars__history__text}>
                    Протягом 1980-х років BMW продовжувала відточувати й удосконалювати свою модельну лінійку, випускаючи все більш вишукані та спортивні моделі 3, 5, 7 і 8 серії з дедалі вищим рівнем технологій. У 1987 році BMW вкрав марш на Mercedes-Benz з першим німецьким V12 післявоєнного періоду, 750iL, який використовував 300-сильний 5,0-літровий двигун, який був гладким і дуже витонченим.
                </p>
                <div className={s.cars__article__image}>
                    <img 
                        src={bmw750}
                        alt='bmw750'
                    />
                </div>
                <p className={s.cars__history__title}>1990-ті роки</p>
                <p className={s.cars__history__text}>
                    Це десятиліття стало роком експансії для BMW, як з точки зору моделей, так і з точки зору виробництва. Щоб сприяти цьому, BMW потребував додаткових виробничих потужностей; у 1994 році було відкрито північноамериканський завод у Спартанбурзі, Південна Кароліна. Спочатку він створив новий родстер Z3, який зіграв головну роль у фільмі про Бонда «Золоте око», але згодом він став одним із найбільших заводів BMW.
                </p>
                <p className={s.cars__history__text}>
                    Розширення власного асортименту автомобілів було не єдиним планом у рукаві BMW. 1994 рік також став роком, коли BMW придбала Rover Group з наміром розширити модельний ряд. Група Rover складалася з багатьох брендів, включаючи Land Rover, Rover, MG, Triumph і Mini; BMW намагалася асимілювати ці компанії у свій продуктовий портфель, проект, який був остаточно приречений на провал. Кульмінацією цього стало те, що у 2000 році BMW продала Rover Group, причому єдина компанія, на яку вона зберегла права, була брендом Mini – офіційно стилізованим як MINI.
                </p>
                <p className={s.cars__history__text}>
                    Rover Group була не єдиним поглинанням; у 1998 році BMW придбала бренд і права на найменування автомобілів Rolls-Royce, хоча лише в 2003 році компанія випустила нову модель. На початку десятиліття BMW також постачав двигун для іншої британської фірми, McLaren, і 6,1-літровий V12, розроблений Полом Роше, зробив McLaren F1 найшвидшим серійним автомобілем у світі.
                </p>
                <div className={s.cars__article__image}>
                    <img 
                        src={mcLaren}
                        alt='mcLaren'
                    />
                </div>
            </div>
            <div className={s.cars__article}>
                <h2 className={s.cars__history__title}>2000-ті роки</h2>
                <p className={s.cars__history__text}>
                    Перше десятиліття нового століття було напруженим для BMW: у 2001 році на заводі в Оксфорді розпочато виробництво нового BMW MINI, який компанія залишила після відокремлення від Rover. Новий Rolls-Royce Phantom, який використовував більшу частину ходової частини поточної на той час 7 серії, дебютував у 2003 році, і продукти обох нових брендів BMW отримали майже загальне визнання.
                </p>
                <p className={s.cars__history__text}>
                    Проте катастрофа Rover залишила BMW з дірою в запропонованому асортименті; BMW потрібна була модель, щоб заповнити розрив між MINI та моделями 3-ї серії. Знайомтеся з найпершим BMW 1 серії, який вийшов на ринок у 2004 році. Він був унікальним на ринку хетчбеків, оскільки мав задній привід, тоді як практично всі інші виробники використовували платформу з переднім приводом. Це зробило його вибором для захоплених водіїв, навіть якщо він дещо заважав упаковці автомобіля. Подальші моделі будуть випущені в серії 1, включаючи купе та кабріолет.
                </p>
                <p className={s.cars__history__text}>
                    У той час як BMW розширював свій модельний ряд, його традиційна клієнтська база не була забута; У цьому десятилітті відбувся дебют двох найбільш знакових автомобілів M. У 2003 році був запущений E46 M3 CSL, ще більш жорстка версія його високопродуктивного купе з полегшеними компонентами (включно з панеллю даху з вуглецевого волокна), більшою потужністю, орієнтованими на трасу шинами та ковшеподібними сидіннями. У 2005 році дебютував суперседан BMW M5 покоління E60 з п'ятилітровим двигуном V10, натхненним Формуло-1, який розкручувався до неймовірних 8250 об/хв і виробляв 507 к.с.
                </p>
                <p className={s.cars__history__title}>2010 по сьогоднішній день</p>
                <p className={s.cars__history__text}>
                        Останнім часом BMW ще більше розширив свій портфель продуктів; 4 серія зайняла місце купе 3 серії, тоді як різні моделі породили власні варіації, що заповнили нішу, а також майже однакову лінійку моделей серії X, включаючи величезний X7 і стильний X2. Обсяги виробництва зросли з приблизно 1,4 мільйона автомобілів на рік у 2005 році до 2,2 мільйона у 2021 році.
                </p>
                <p className={s.cars__history__text}>
                    Компанія ніколи не спочивала на лаврах, і протягом останнього десятиліття BMW прагнула відкривати нові технології для задоволення майбутніх потреб своїх клієнтів. Моделі Efficient Dynamics використовують інтелектуальну технологію для зменшення споживання палива, тоді як гібридні версії є частиною лінійки моделей з 2010 року. Водень був частиною складу компанії протягом багатьох років з невеликим виробництвом моделей 7 серії, що використовують це паливо, і сьогодні. BMW також тестує автомобілі на водневих паливних елементах.
                </p>
                <p className={s.cars__history__text}>
                    І, звичайно, є новий поштовх до електрифікації. BMW був одним із перших виробників, який випустив на ринок автомобіль, розроблений з нуля як електромобіль, BMW i3, який дебютував у 2013 році. Він мав новаторську конструкцію з карбону та композитні панелі, а також інтер’єр, виготовлений із стійких матеріалів, таких як бамбук.
                </p>
                <div className={s.cars__article__image}>
                    <img 
                        src={bmwX7}
                        alt='bmwX7'
                    />
                </div>
            </div>
        </div>
    );
};
